{
  "name": "overview",
  "introduction": [
    "# MUI X - Overview\n\n<p class=\"description\">MUI X is a collection of advanced React UI components for complex use cases. Use the native integration with Material UI or extend your design system.</p>"
  ],
  "code_path": [
    null
  ],
  "children": [
    {
      "name": "Introduction",
      "introduction": [
        "Introduction\n\nMUI X is a collection of advanced UI components, including:\n\n- [Data Grid](/x/react-data-grid/)\n- [Date and Time Pickers](/x/react-date-pickers/)\n- [Charts](/x/react-charts/)\n- [Tree View](/x/react-tree-view/)\n\nThese components are significantly more complex than the ones found in our Core libraries.\nThey feature advanced functionality for data-rich applications and a wide range of other use cases.\n\n:::info\nMUI X is **open core**—base components are MIT-licensed, while more advanced features require a Pro or Premium commercial license.\nSee [Licensing](/x/introduction/licensing/) for details.\n\nThroughout the documentation, Pro- and Premium-only features are denoted with the [<span class=\"plan-pro\"></span>](/x/introduction/licensing/#pro-plan 'Pro plan') and [<span class=\"plan-premium\"></span>](/x/introduction/licensing/#premium-plan 'Premium plan') icons, respectively.\n:::"
      ],
      "code_path": [
        null
      ],
      "children": []
    },
    {
      "name": "Advantages of MUI X",
      "introduction": [
        "Advantages of MUI X\n\n- **Ship faster:** Our team has invested thousands of hours into these components so you don't have to. Get up and running in a fraction of the time it would take to build from scratch.\n- **Expand on the power of Core**: MUI X components work seamlessly with Core libraries like Material UI, delivering more advanced functionality, but can also be used standalone.\n- **Grow with us:** You can start for free with the MIT-licensed packages, and upgrade to Pro or Premium when you need more advanced features or technical support.\n- **Dedicated maintenance:** MUI X is maintained by a full-time staff of engineers, so you can rest assured that any issues will be addressed in a timely manner.\n- **Technical support:** Pro and Premium users get access to technical support from our team as well as priority for bug fixes and feature requests."
      ],
      "code_path": [
        null
      ],
      "children": []
    },
    {
      "name": "MUI X vs. Core",
      "introduction": [
        "MUI X vs. Core\n\nMUI X is a collection of advanced UI components for complex use cases.\nMost of MUI X's components are available for free, but more advanced features require a Pro or Premium commercial license.\n\nCore focuses on empowering the creation of great design systems with React.\nIt comes with two themes (Material Design and an in-house one).\nIt's about solving design problems.\nIt contains foundational UI component libraries like Material UI and Base UI.\nThese libraries are open source, MIT-licensed, and free forever.\n\nMUI X components are fully compatible with Core.\nMUI X can extend the functionality of UIs built with Material UI or Base UI, but its components can also stand on their own, they can be used with third-parties React component libraries that implement different designs.\n\nYou can find [more details](https://mui-org.notion.site/X-FAQ-c33e9a7eabba4da1ad7f8c04f99044cc#11751b16538c489ba23c5133db1e67b8) about the difference in our handbook."
      ],
      "code_path": [
        null
      ],
      "children": []
    }
  ]
}